In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Whole Dataset

In [2]:
df_dirty = pd.read_csv('../data/train.csv')
df_dirty.head()

,MONTH,TOWN,FLAT_TYPE,BLOCK,STREET,FLOOR_RANGE,FLOOR_AREA_SQM,FLAT_MODEL,ECO_CATEGORY,LEASE_COMMENCE_DATA,RESALE_PRICE
0,2020-10,woodlands,4 room,681B,woodlands drive 62,07 to 09,102.0,premium apartment,uncategorized,2000,420000.0
1,2021-07,bishan,4 room,264,bishan street 24,07 to 09,104.0,model a,uncategorized,1992,585000.0
2,2021-05,bukit panjang,4 room,520,jelapang road,19 to 21,102.0,model a,uncategorized,1998,450000.0
3,2021-08,punggol,4 room,121B,edgedale plains,16 to 18,93.0,model a,uncategorized,2017,465000.0
4,2023-05,hougang,5 room,997B,Buangkok Crescent,10 to 12,113.0,improved,uncategorized,2018,710000.0

In [3]:
df_dirty.describe()

       FLOOR_AREA_SQM  LEASE_COMMENCE_DATA  RESALE_PRICE
count   162691.000000        162691.000000  1.626910e+05
mean        96.891250          1996.358993  5.188430e+05
std         24.030547            14.245920  1.832442e+05
min         31.000000          1966.000000  1.500000e+05
25%         82.000000          1985.000000  3.820000e+05
50%         93.000000          1996.000000  4.880000e+05
75%        112.000000          2011.000000  6.220000e+05
max        366.700000          2022.000000  1.658888e+06

In [4]:
df_dirty.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 162691 entries, 0 to 162690
Data columns (total 11 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   MONTH                162691 non-null  object
 1   TOWN                 162691 non-null  object
 2   FLAT_TYPE            162691 non-null  object
 3   BLOCK                162691 non-null  object
 4   STREET               162691 non-null  object
 5   FLOOR_RANGE          162691 non-null  object
 6   FLOOR_AREA_SQM       162691 non-null  float64
 7   FLAT_MODEL           162691 non-null  object
 8   ECO_CATEGORY         162691 non-null  object
 9   LEASE_COMMENCE_DATA  162691 non-null  int64
 10  RESALE_PRICE         162691 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 13.7+ MB

# Town

In [5]:
df_dirty['TOWN'].unique()

array(['woodlands', 'bishan', 'bukit panjang', 'punggol', 'hougang',
       'clementi', 'bedok', 'yishun', 'sengkang', 'queenstown',
       'bukit batok', 'pasir ris', 'toa payoh', 'geylang', 'tampines',
       'bukit merah', 'ang mo kio', 'sembawang', 'choa chu kang',
       'jurong west', 'kallang/whampoa', 'serangoon', 'central area',
       'jurong east', 'marine parade', 'bukit timah'], dtype=object)

In [6]:
df_dirty['TOWN'].value_counts()

sengkang           13335
punggol            11925
woodlands          11506
yishun             11175
tampines           11030
jurong west        10781
bedok               8457
hougang             8120
choa chu kang       7397
bukit batok         6733
ang mo kio          6623
bukit merah         6184
bukit panjang       5891
toa payoh           5182
kallang/whampoa     4994
sembawang           4828
pasir ris           4737
queenstown          4391
geylang             3995
clementi            3599
jurong east         3364
serangoon           2884
bishan              2872
central area        1286
marine parade       1001
bukit timah          401
Name: TOWN, dtype: int64

# Flat Type

In [7]:
df_dirty['FLAT_TYPE'].unique()

array(['4 room', '5 room', '3 room', '5-room', '3-room', 'executive',
       '4-room', '2-room', '2 room', '1 room', 'multi generation',
       '1-room'], dtype=object)

# Block

In [8]:
df_dirty['BLOCK'].unique()

array(['681B', '264', '520', ..., '858B', '796A', '858A'], dtype=object)

In [9]:
df_dirty['BLOCK'].unique().shape

(2741,)

In [10]:
df_dirty['BLOCK'].value_counts()

1       494
2       478
8       442
9       425
101     411
       ...
795A      1
860A      1
464B      1
858B      1
858A      1
Name: BLOCK, Length: 2741, dtype: int64

# Street

In [11]:
df_dirty['STREET'].unique()

array(['woodlands drive 62', 'bishan street 24', 'jelapang road', ...,
       'Seng Poh Road', 'jurong west street 51', 'sembawang way'],
      dtype=object)

In [12]:
df_dirty['STREET'].unique().shape

(1145,)

In [13]:
df_dirty['STREET'].value_counts()

yishun ring road         1398
bedok reservoir road     1032
punggol drive            1020
punggol field             947
Yishun Ring Road          940
                         ...
jurong west street 51       3
margaret drive              2
geylang east avenue 2       2
Margaret Drive              1
Seng Poh Road               1
Name: STREET, Length: 1145, dtype: int64

# Floor Range

In [14]:
temp = df_dirty['FLOOR_RANGE'].unique()
temp.sort()
temp

array(['01 to 03', '04 to 06', '07 to 09', '10 to 12', '13 to 15',
       '16 to 18', '19 to 21', '22 to 24', '25 to 27', '28 to 30',
       '31 to 33', '34 to 36', '37 to 39', '40 to 42', '43 to 45',
       '46 to 48', '49 to 51'], dtype=object)

In [15]:
df_dirty['FLOOR_RANGE'].value_counts()

04 to 06    37358
07 to 09    34103
10 to 12    30239
01 to 03    28682
13 to 15    15812
16 to 18     7342
19 to 21     3147
22 to 24     2212
25 to 27     1392
28 to 30      887
31 to 33      473
34 to 36      426
37 to 39      359
40 to 42      158
43 to 45       52
46 to 48       35
49 to 51       14
Name: FLOOR_RANGE, dtype: int64

# Flat Model

In [16]:
df_dirty['FLAT_MODEL'].unique()

array(['premium apartment', 'model a', 'improved', 'new generation',
       'standard', 'maisonette', 'dbss', 'simplified', 'apartment',
       'model a2', 'type s1', 'adjoined flat', 'model a maisonette',
       'type s2', '3gen', '2 room', 'terrace', 'premium apartment loft',
       'premium maisonette', 'multi generation', 'improved maisonette'],
      dtype=object)

In [17]:
df_dirty['FLAT_MODEL'].value_counts()

model a                   57927
improved                  39796
new generation            19908
premium apartment         18115
simplified                 6177
apartment                  5892
maisonette                 4524
standard                   4364
dbss                       2607
model a2                   1861
adjoined flat               290
model a maisonette          281
type s1                     272
2 room                      225
type s2                     133
premium apartment loft       91
terrace                      85
multi generation             68
3gen                         41
improved maisonette          21
premium maisonette           13
Name: FLAT_MODEL, dtype: int64

Variants of the same type

model a vs. model a maisonette (the latter is really just a maisonette under Model A scheme).

premium apartment, premium apartment loft, premium maisonette → all “premium” flats, but appear as separate categories. Decide if you want them merged or treated separately (depends on analysis).

Rare / legacy models

type s1, type s2, adjoined flat, terrace are quite rare.

May cause class imbalance issues if used directly in ML.

DBSS vs. 3Gen vs. Multi-Generation

These are unique categories; they should stay separate, but they’re very infrequent in the dataset.

You may need to group them as "Others" if they appear <1% of cases.

# Eco Category

In [18]:
df_dirty['ECO_CATEGORY'].unique()

array(['uncategorized'], dtype=object)

# Lease commence data

In [19]:
temp = df_dirty['LEASE_COMMENCE_DATA'].unique()
temp.sort()
temp

array([1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976,
       1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020,
       2021, 2022], dtype=int64)

In [20]:
df_dirty.shape

(162691, 11)